app/Controllers/ClientController.php

    public function login(): string
    {
        $prefixModel = new PrefixOperateur();

        return view('client/login', [
            'prefixes' => array_column($prefixModel->findAll(), 'prefix'),
        ]);
---
SELECT *
FROM `prefixOperateur`

    public function dashboard(): string|RedirectResponse
    {
        $compte = $this->currentCompte();

        if ($compte === null) {
            return redirect()->to('/client/login');
        }

        $typeOperationModel = new TypeOperation();
        $trancheModel        = new Tranche();

        $feeSlabs = [];
        foreach (['retrait', 'transfert'] as $type) {
            $typeOperation   = $typeOperationModel->findByLibelle(ucfirst($type));
            $feeSlabs[$type] = ($typeOperation !== null && $typeOperation['idBareme'] !== null)
                ? $trancheModel->getSlabsByBareme((int) $typeOperation['idBareme'])
                : [];
        }

        $mouvementModel = new Mouvement();
        $prefixModel    = new PrefixOperateur();
        $operateurModel = new Operateur();

        // Récupérer les préfixes avec leurs opérateurs pour détecter les transferts inter-opérateurs
        $allPrefixes = $prefixModel->findAll();
---
SELECT *
FROM `prefixOperateur`

    private function currentCompte(): ?array
    {
        if (! session()->get('isLoggedIn')) {
            return null;
        }

        $compteModel = new Compte();
        $compte      = $compteModel->find(session()->get('client_id'));
---
SELECT *
FROM `compte`
WHERE `compte`.`id` = 2