app/Controllers/ClientController.php

SELECT *
FROM `compte`
WHERE `compte`.`id` = 6
---
    private function currentCompte(): ?array
    {
        if (! session()->get('isLoggedIn')) {
            return null;
        }

        $compteModel = new Compte();
        $compte      = $compteModel->find(session()->get('client_id'));