app/Controllers/CompteController.php

SELECT *
FROM `TypeOperation`
ORDER BY `id` ASC
---
    public function afficherComptes(): string|\CodeIgniter\HTTP\RedirectResponse
    {
        $idOperateur = session()->get('idOperateur');

        if ($idOperateur === null) {
            return redirect()->to('/operator');
        }

        $compteModel = new Compte();
        $mouvementModel = new Mouvement();
        $prefixModel = new PrefixOperateur();
        $typeOperationModel = new TypeOperation();
        $trancheModel = new Tranche();

        $gains = $mouvementModel->calculGainParOperateur($idOperateur);
        $gains['total'] = array_sum($gains);
        $gains['liste'] = $mouvementModel->getMouvementDetails($idOperateur);

        $typeOperations = $typeOperationModel->orderBy('id', 'ASC')->findAll();