app/Controllers/OperateurController.php

    public function choisir(): string
    {
        $operateurModel = new Operateur();

        $data = [
            'operateurs' => $operateurModel->orderBy('nom', 'ASC')->findAll(),
        ];
---
SELECT *
FROM `Operateur`
ORDER BY `nom` ASC

    public function selectionner(int $idOperateur)
    {
        $operateurModel = new Operateur();
        $operateur = $operateurModel->find($idOperateur);
---
SELECT *
FROM `Operateur`
WHERE `Operateur`.`id` = 1