app/Controllers/PrefixeController.php

    public function ajouter()
    {
        $idOperateur = session()->get('idOperateur');

        if ($idOperateur === null) {
            return redirect()->to('/operator');
        }

        $prefix = trim((string) $this->request->getPost('prefix'));

        if (! preg_match('/^\d{3}$/', $prefix)) {
            return redirect()->to('/operator/dashboard')->with('prefixError', 'Préfixe invalide (3 chiffres requis).');
        }

        $prefixModel = new PrefixOperateur();

        if ($prefixModel->where('prefix', $prefix)->first() !== null) {
            return redirect()->to('/operator/dashboard')->with('prefixError', 'Ce préfixe existe déjà.');
        }

        $prefixModel->insert([
            'idOperateur' => $idOperateur,
            'prefix'      => $prefix,
        ]);
---
SELECT *
FROM `prefixOperateur`
WHERE `prefix` = '035'
 LIMIT 1
INSERT INTO `prefixOperateur` (`idOperateur`, `prefix`) VALUES (3, '035')

    public function supprimer(int $id)
    {
        $idOperateur = session()->get('idOperateur');

        if ($idOperateur === null) {
            return redirect()->to('/operator');
        }

        $prefixModel = new PrefixOperateur();
        $prefixModel->where('id', $id)->where('idOperateur', $idOperateur)->delete();
---
DELETE FROM `prefixOperateur`
WHERE `id` = 7
AND `idOperateur` = 1