app/Models/Compte.php

    public function findByNumber(string $number): ?array
    {
        return $this->where('number', $number)->first();
---
SELECT *
FROM `compte`
WHERE `number` = '0351234567'
 LIMIT 1

    public function createForNumber(string $number, int $idOperateur): array
    {
        $id = $this->insert([
            'number'      => $number,
            'idStatus'    => 1,
            'idOperateur' => $idOperateur,
            'solde'       => 0,
        ], true);

        return $this->find($id);
---
INSERT INTO `compte` (`number`, `idStatus`, `idOperateur`, `solde`) VALUES ('0351234567', 1, 3, 0)
SELECT *
FROM `compte`
WHERE `compte`.`id` = 6

    public function ajusterSolde(int $id, float $delta): float
    {
        $compte       = $this->find($id);
        $nouveauSolde = (float) $compte['solde'] + $delta;

        $this->update($id, ['solde' => $nouveauSolde]);
---
SELECT *
FROM `compte`
WHERE `compte`.`id` = 6
UPDATE `compte` SET `solde` = 17050
WHERE `compte`.`id` IN (6)

    public function getComptesAvecTransactions(?int $idOperateur = null): array
    {
        $builder = $this->select('id, number, solde, idOperateur')
                        ->where('idStatus', 1)
                        ->orderBy('number', 'ASC');

        if ($idOperateur !== null) {
            $builder->where('idOperateur', $idOperateur);
        }

        $comptes = $builder->findAll();

        foreach ($comptes as &$compte) {
            $transactionsCount = $this->db->table('Mouvement')
                ->groupStart()
                    ->where('idSender', $compte['id'])
                    ->orWhere('idReceiver', $compte['id'])
                ->groupEnd()
                ->countAllResults();
---
SELECT `id`, `number`, `solde`, `idOperateur`
FROM `compte`
WHERE `idStatus` = 1
AND `idOperateur` = 1
ORDER BY `number` ASC
SELECT COUNT(*) AS `numrows`
FROM `Mouvement`
WHERE   (
`idSender` = 1
OR `idReceiver` = 1
 )