app/Models/Mouvement.php

SELECT *
FROM `TypeOperation`
---
    public function calculGainParOperateur(int $idOperateur, $dateMin = null, $dateMax = null): array
    {
        $typeOperationModel = new TypeOperation();
        $typeOperations = $typeOperationModel->findAll();

SELECT SUM(`montantFrais`) AS `frais`
FROM `Mouvement`
WHERE `idOperateur` = 1
AND `idTypeOperation` = 1
---
    public function calculGainParTypeOperation(int $idOperateur, int $idTypeOperation, $dateMin = null, $dateMax = null)
    {
        $mouvementModel = new Mouvement();

        $builder = $mouvementModel->builder();

        $builder->selectSum('montantFrais', 'frais')
            ->where('idOperateur', $idOperateur)
            ->where('idTypeOperation', $idTypeOperation);

        if ($dateMin !== null) {
            $builder->where('dateMouvement >=', $dateMin);
        }

        if ($dateMax !== null) {
            $builder->where('dateMouvement <=', $dateMax);
        }

        $result = $builder->get()->getRowArray();

SELECT `Mouvement`.`id`, `Mouvement`.`idSender`, `Mouvement`.`idReceiver`, `Mouvement`.`somme`, `Mouvement`.`montantFrais`, `Mouvement`.`dateMouvement`, `Mouvement`.`idTypeOperation`, `TypeOperation`.`libelle` as `typeLibelle`
FROM `Mouvement`
JOIN `TypeOperation` ON `TypeOperation`.`id` = `Mouvement`.`idTypeOperation`
WHERE `Mouvement`.`idOperateur` = 1
---
    public function getMouvementDetails(int $idOperateur, $dateMin = null, $dateMax = null): array
    {
        $builder = $this->builder();

        $builder->select('Mouvement.id, Mouvement.idSender, Mouvement.idReceiver, Mouvement.somme, Mouvement.montantFrais, Mouvement.dateMouvement, Mouvement.idTypeOperation, TypeOperation.libelle as typeLibelle')
            ->join('TypeOperation', 'TypeOperation.id = Mouvement.idTypeOperation')
            ->where('Mouvement.idOperateur', $idOperateur);

        if ($dateMin !== null) {
            $builder->where('Mouvement.dateMouvement >=', $dateMin);
        }

        if ($dateMax !== null) {
            $builder->where('Mouvement.dateMouvement <=', $dateMax);
        }

        return $builder->get()->getResultArray();

SELECT `Mouvement`.`id`, `Mouvement`.`somme`, `Mouvement`.`montantFrais`, `Mouvement`.`dateMouvement`, `Mouvement`.`idSender`, `Mouvement`.`idReceiver`, `TypeOperation`.`libelle` AS `typeLibelle`, `sender`.`number` AS `senderNumber`, `receiver`.`number` AS `receiverNumber`
FROM `Mouvement`
JOIN `TypeOperation` ON `TypeOperation`.`id` = `Mouvement`.`idTypeOperation`
LEFT JOIN `compte` AS `sender` ON `sender`.`id` = `Mouvement`.`idSender`
LEFT JOIN `compte` AS `receiver` ON `receiver`.`id` = `Mouvement`.`idReceiver`
WHERE   (
`Mouvement`.`idSender` = 2
OR `Mouvement`.`idReceiver` = 2
 )
ORDER BY `Mouvement`.`dateMouvement` DESC, `Mouvement`.`id` DESC
---
    public function getHistoriqueCompte(int $idCompte, float $soldeActuel): array
    {
        $rows = $this->select(
            'Mouvement.id, Mouvement.somme, Mouvement.montantFrais, Mouvement.dateMouvement, ' .
                'Mouvement.idSender, Mouvement.idReceiver, TypeOperation.libelle AS typeLibelle, ' .
                'sender.number AS senderNumber, receiver.number AS receiverNumber'
        )
            ->join('TypeOperation', 'TypeOperation.id = Mouvement.idTypeOperation')
            ->join('compte AS sender', 'sender.id = Mouvement.idSender', 'left')
            ->join('compte AS receiver', 'receiver.id = Mouvement.idReceiver', 'left')
            ->groupStart()
            ->where('Mouvement.idSender', $idCompte)
            ->orWhere('Mouvement.idReceiver', $idCompte)
            ->groupEnd()
            ->orderBy('Mouvement.dateMouvement', 'DESC')
            ->orderBy('Mouvement.id', 'DESC')
            ->findAll();