app/Models/Mouvement.php

SELECT `Mouvement`.`id`, `Mouvement`.`somme`, `Mouvement`.`montantFrais`, `Mouvement`.`dateMouvement`, `Mouvement`.`idSender`, `Mouvement`.`idReceiver`, `TypeOperation`.`libelle` AS `typeLibelle`, `sender`.`number` AS `senderNumber`, `receiver`.`number` AS `receiverNumber`
FROM `Mouvement`
JOIN `TypeOperation` ON `TypeOperation`.`id` = `Mouvement`.`idTypeOperation`
LEFT JOIN `compte` AS `sender` ON `sender`.`id` = `Mouvement`.`idSender`
LEFT JOIN `compte` AS `receiver` ON `receiver`.`id` = `Mouvement`.`idReceiver`
WHERE   (
`Mouvement`.`idSender` = 3
OR `Mouvement`.`idReceiver` = 3
 )
ORDER BY `Mouvement`.`dateMouvement` DESC, `Mouvement`.`id` DESC
---
    public function getHistoriqueCompte(int $idCompte, float $soldeActuel): array
    {
        $rows = $this->select(
                'Mouvement.id, Mouvement.somme, Mouvement.montantFrais, Mouvement.dateMouvement, ' .
                'Mouvement.idSender, Mouvement.idReceiver, TypeOperation.libelle AS typeLibelle, ' .
                'sender.number AS senderNumber, receiver.number AS receiverNumber'
            )
            ->join('TypeOperation', 'TypeOperation.id = Mouvement.idTypeOperation')
            ->join('compte AS sender', 'sender.id = Mouvement.idSender', 'left')
            ->join('compte AS receiver', 'receiver.id = Mouvement.idReceiver', 'left')
            ->groupStart()
                ->where('Mouvement.idSender', $idCompte)
                ->orWhere('Mouvement.idReceiver', $idCompte)
            ->groupEnd()
            ->orderBy('Mouvement.dateMouvement', 'DESC')
            ->orderBy('Mouvement.id', 'DESC')
            ->findAll();