app/Models/Mouvement.php

        $idSender   = $type === 'depot' ? null : $compte['id'];
        $idReceiver = $type === 'retrait' ? null : ($type === 'transfert' ? $target['id'] : $compte['id']);

        $this->insert([
            'somme'           => $includeFee && $type === 'transfert' ? $amountToSend : $amount,
            'montantFrais'    => $fee,
            'idTypeOperation' => $typeOperation['id'],
            'idSender'        => $idSender,
            'idReceiver'      => $idReceiver,
            'idOperateur'     => $compte['idOperateur'],
        ]);
---
INSERT INTO `Mouvement` (`somme`, `montantFrais`, `idTypeOperation`, `idSender`, `idReceiver`, `idOperateur`) VALUES (100, 0, 1, NULL, 6, 3)