app/Models/PrefixOperateur.php

SELECT *
FROM `prefixOperateur`
WHERE `idOperateur` = 1
ORDER BY `prefix` ASC
---
    public function getPrefixesByOperateur(int $idOperateur): array
    {
        return $this->where('idOperateur', $idOperateur)
            ->orderBy('prefix', 'ASC')
            ->findAll();

SELECT *
FROM `prefixOperateur`
WHERE `prefix` = '035'
 LIMIT 1
---
    public function findOperateurIdByPrefix(string $prefix): ?int
    {
        $row = $this->where('prefix', $prefix)->first();