app/Models/Tranche.php

    public function getSlabsByBareme(int $idBareme): array
    {
        return $this->where('idBareme', $idBareme)->orderBy('min', 'ASC')->findAll();
---
SELECT *
FROM `tranche`
WHERE `idBareme` = 1
ORDER BY `min` ASC