app/Models/TypeOperation.php

SELECT *
FROM `TypeOperation`
WHERE `libelle` = 'Retrait'
 LIMIT 1
---
    public function findByLibelle(string $libelle): ?array
    {
        return $this->where('libelle', $libelle)->first();